adailtonjn68/STM32-Assembly-Blink-LED-With-SysTick/Core/Inc/stm32f10x_constants.inc
.syntax unified
.cpu cortex-m3
.fpu softvfp
.thumb


 @ General BIT constants
.equ BIT0,					(0x00000001)
.equ BIT1,					(0x00000002)
.equ BIT2,					(0x00000004)
.equ BIT3,					(0x00000008)
.equ BIT4,					(0x00000010)
.equ BIT5,					(0x00000020)
.equ BIT6,					(0x00000040)
.equ BIT7,					(0x00000080)
.equ BIT8,					(0x00000100)
.equ BIT9,					(0x00000200)
.equ BIT10,					(0x00000400)
.equ BIT11,					(0x00000800)
.equ BIT12,					(0x00001000)
.equ BIT13,					(0x00002000)
.equ BIT14,					(0x00004000)
.equ BIT15,					(0x00008000)
.equ BIT16,					(0x00010000)
.equ BIT17,					(0x00020000)
.equ BIT18,					(0x00040000)
.equ BIT19,					(0x00080000)
.equ BIT20,					(0x00100000)
.equ BIT21,					(0x00200000)
.equ BIT22,					(0x00400000)
.equ BIT23,					(0x00800000)
.equ BIT24,					(0x01000000)
.equ BIT25,					(0x02000000)
.equ BIT26,					(0x04000000)
.equ BIT27,					(0x08000000)
.equ BIT28,					(0x10000000)
.equ BIT29,					(0x20000000)
.equ BIT30,					(0x40000000)
.equ BIT31,					(0x80000000)
